---
kind: method
id: M:Autodesk.Revit.DB.ElementSet.ForwardIterator
source: html/7669d355-7297-5076-7d40-93070483172a.htm
---
# Autodesk.Revit.DB.ElementSet.ForwardIterator Method

Retrieve a forward moving iterator to the set.

## Syntax (C#)
```csharp
public virtual ElementSetIterator ForwardIterator()
```

## Returns
Returns a forward moving iterator to the set.